loadtesting.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 60
      arrivalRate: 100
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
  variables: 
    sampleListingid: 
      - [9195999, 9999999, 10000000]
scenarios:
  - flow:
    - loop: 
      - get:
          url: "/listings/{{ $loopElement }}/photos"
      count: 100
      over: sampleListingid