loadtesting.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 30
      arrivalRate: 5
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
  processor: "./randomizer.js"
scenarios:
  - flow:
    - loop: 
      - function: "generate100Data"
      - get:
          url: "/listings/{{ url }}/photos"
      count: 100